#Задача 2. Напишите программу, которая найдёт произведение пар чисел списка.
#Парой считаем первый и последний элемент, второй и предпоследний и т.д.
# - [2, 3, 4, 5, 6] => [12, 15, 16];
# - [2, 3, 5, 6] => [12, 15]
def qw(st1,st2):
    if (len(st1) % 2) != 0:
        n = (len(st1)//2)+1
    else:
        n = (len(st1)//2)

    res = list()
    i = 0
    while i < n:
        k = st1[i] * st2[i]
        #print(k)
        res.append(k)
        i += 1
    print(res)

ls1 = [2, 3, 4, 5, 6]
ls2 = ls1[::-1]
print(ls1, ls2)
qw(ls1,ls2)





